       01  REG-IN003.
           05 IN3-CHAVE             PIC X(10).
           05 IN3-COD-SEGMENTO      PIC X(03).
           05 IN3-FATOR-AJUSTE      PIC 9(03)V99.
           05 IN3-LIMITE-CRED       PIC 9(09)V99.
           05 IN3-CANAL-REF         PIC X(02).
           05 IN3-TIPO-CLIENTE      PIC X(01).
           05 IN3-DATA-REF          PIC 9(08).
           05 IN3-FLAG-BLOQUEIO     PIC X(01).
           05 IN3-FILLER            PIC X(39).
